Repository: Victor-shadow/neo-vote
Catalog: lib/core/l10n/app_*.arb
Languages: rw, sw

source: Welcome to NeoVote
rw: Murakaza neza muri NeoVote
sw: Karibu NeoVote

# authSlogan
source: Secure, transparent, and easy voting.
rw: Umutekano, kugaragara, no gutora byoroshye.
sw: Salama, wazi, na kupiga kura kwa urahisi.

source: Send Code
rw: Ohereza Kode
sw: Tuma Msimbo

source: Phone Number
rw: Numero ya Telefoni
sw: Nambari ya Simu

source: Login with Biometrics
rw: Injira ukoresheje Ubumenyi bw'Umubiri
sw: Ingia kwa Kibayometriki

source: Verify Your Number
rw: Emeza Numero Yawe
sw: Thibitisha Nambari Yako

# enterOtp
source: Enter the 6-digit code sent to
rw: Injiza kode ya 6-digit yoherejwe kuri
sw: Ingiza msimbo wa tarakimu 6 uliotumwa kwa

source: Verification Code
rw: Kode yo Kwemeza
sw: Msimbo wa Uthibitisho

# verifyAndProceed
source: Verify & Proceed
rw: Emeza & Kongera
sw: Thibitisha & Endelea

source: Resend Code
rw: Ohereza Kode Nanone
sw: Tuma Msimbo Tena

source: Active Elections
rw: Amatora Arimo
sw: Uchaguzi Unaoendelea

source: No Active Elections
rw: Nta Matora Arimo
sw: Hakuna Uchaguzi Unaoendelea

# noActiveElectionsMessage
source: There are currently no elections available for you to vote in. Pull down to refresh or check back later.
rw: Nta matora arimo ubu ufite uburenganzira bwo gutora. Kanda hasi kugira ngo uvugurure cyangwa usubire inyuma.
sw: Hakuna uchaguzi unaoendelea kwa sasa unaoweza kupiga kura. Buruta chini ili kupakia upya au angalia baadaye.

source: Cast Your Vote
rw: Tora Ijwi Ryawe
sw: Piga Kura Yako

# reviewAndSubmit
source: Review & Submit Vote
rw: Reba & Tora Ijwi
sw: Kagua & Wasilisha Kura

source: Confirm Your Selection
rw: Emeza Ihitamo Ryawe
sw: Thibitisha Uteuzi Wako

source: You have selected:
rw: Wahisemo:
sw: Umechagua:

# confirmAndCast
source: Confirm & Cast My Vote
rw: Emeza & Tora Ijwi Ryanjye
sw: Thibitisha & Piga Kura Yangu

# voteCastSuccessTitle
source: Vote Cast Successfully!
rw: Ijwi Ryatorwe Neza!
sw: Kura Imetumwa Kwa Mafanikio!

# voteCastSuccessMessage
source: Your vote has been securely recorded on the blockchain.
rw: Ijwi ryawe ryakiriwe neza kuri blockchain.
sw: Kura yako imehifadhiwa salama kwenye blockchain.

# profileAndSettings
source: Profile & Settings
rw: Umwirondoro & Igenamiterere
sw: Wasifu & Mipangilio

source: Name
rw: Izina
sw: Jina

source: Appearance
rw: Imigaragarire
sw: Muonekano

source: Language
rw: Ururimi
sw: Lugha

source: View Vote Receipts
rw: Reba Inyemezabwishyu z'Amajwi
sw: Tazama Risiti za Kura

source: Log Out
rw: Sohoka
sw: Ondoka

source: Profile
rw: Umwirondoro
sw: Wasifu
